Store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/Товары/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки товаров на указанных складах на заданную дату.
//
// Параметры:
//   ДатаАктуальности - Дата - момент времени, на который получаются остатки
//   Номенклатура - СправочникСсылка.Номенклатура - номенклатура, для которой запрашиваются остатки
//   Склады - Массив из СправочникСсылка.Склады - список складов, по которым получаются остатки
//
// Возвращаемое значение:
//   Структура:
//     * <КлючСклада> - Число - количество остатков на складе (ключ - строковое представление ссылки на склад без пробелов)
Функция ПолучитьОстаткиПоСкладам(ДатаАктуальности, Номенклатура, Склады) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.Склад КАК Склад,
	|	ТоварыОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(&ДатаАктуальности, Номенклатура = &Номенклатура И Склад В (&Склады)) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	Запрос.УстановитьПараметр("Склады", Склады);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();

	Остатки = Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		КлючСклада = СтрЗаменить(Строка(Выборка.Склад), " ", "");
		Остатки.Вставить(КлючСклада, Выборка.Количество);
	КонецЦикла;
	
	Возврат Остатки;
	
	Сообщить(НСтр("ru = 'Привет мир!'; en = 'Hello world!'; zh = '你好世界!'; es = '¡Hola mundo!'"));

КонецФункции

#КонецОбласти

#КонецЕсли
